---
kind: method
id: M:Autodesk.Revit.DB.ElementRecord.GetId
source: html/ec06aa09-dac7-641a-e852-1cd6c10195dd.htm
---
# Autodesk.Revit.DB.ElementRecord.GetId Method

Gets the id of the element record.

## Syntax (C#)
```csharp
public ElementId GetId()
```

## Returns
The element id.